package chap8;

/*
 1. 큰 글씨 쓰기
[결과]
자리수를 입력하세요(1~10)
4
0 부터 9까지 4자리 숫자를 입력하세요
1234

  * *** *** * * 

  *   *   * * * 

  * *** *** *** 

  * *     *   * 

  * *** ***   * 
  * 
 */


import java.util.Scanner;

public class SimSim {
 //number[10][5][4]
 public static String[][][] number = { 

   { // 0
	 { "*", "*", "*", " " },
     { "*", " ", "*", " " },
     { "*", " ", "*", " " },
     { "*", " ", "*", " " },
     { "*", "*", "*", " " },
   },

   { // 1
     { " ", " ", "*", " " }, 
     { " ", " ", "*", " " }, 
     { " ", " ", "*", " " }, 
     { " ", " ", "*", " " },
     { " ", " ", "*", " " }, 
     },

   { // 2
     { "*", "*", "*", " " },
     { " ", " ", "*", " " },
     { "*", "*", "*", " " }, 
     { "*", " ", " ", " " },
     { "*", "*", "*", " " }, },

   { // 3

     { "*", "*", "*", " " },
     { " ", " ", "*", " " }, 
     { "*", "*", "*", " " }, 
     { " ", " ", "*", " " },
     { "*", "*", "*", " " }, },

   { // 4

     { "*", " ", "*", " " },
     { "*", " ", "*", " " },
     { "*", "*", "*", " " },
     { " ", " ", "*", " " },
     { " ", " ", "*", " " }, },

   { // 5

     { "*", "*", "*", " " },
     { "*", " ", " ", " " },
     { "*", "*", "*", " " },
     { " ", " ", "*", " " },
     { "*", "*", "*", " " }, },

   { // 6

     { "*", "*", "*", " " },
     { "*", " ", " ", " " },
     { "*", "*", "*", " " },
     { "*", " ", "*", " " },
     { "*", "*", "*", " " }, },

   { // 7

     { "*", "*", "*", " " },
     { " ", " ", "*", " " },
     { " ", " ", "*", " " },
     { " ", " ", "*", " " },
     { " ", " ", "*", " " }, },

   { // 8

     { "*", "*", "*", " " },
     { "*", " ", "*", " " },
     { "*", "*", "*", " " },
     { "*", " ", "*", " " },
     { "*", "*", "*", " " }, },

   { // 9

     { "*", "*", "*", " " },
     { "*", " ", "*", " " },
     { "*", "*", "*", " " },
     { " ", " ", "*", " " },
     { " ", " ", "*", " " },
     }
};


 public static void main(String[] args) {

  Scanner scan = new Scanner(System.in);
  System.out.println("자리수를 입력하세요(1~10)");
  int length = scan.nextInt();
  
  System.out.println("0~9 까지"+length+"자리 수를 입력하세요.");
  String input = scan.next();
  char[] output = new char[length];
  
  for(int i=0;i<length;i++) {
  output[i] = input.charAt(i);
  }
  
  char[] last = new char[length];
  
  for(int i=0;i<length;i++) {
	  last[i] = output[i]; 
  }  
    
  for(int s = 0; s<length;s++) {
	  for(int i=(int)output[s]-'0'; i<=(int)output[s]-'1';i++) {
		  for(int j=0;j<number[i].length;j++) {
			  for(int k=0;k<number[i][j].length;k++) {
				  System.out.print(number[i][j][k]);
			  }
			  System.out.println();
		  }
	  }
  }

  

       }

}